tutorials/fluidSolidInteraction/perpendicularFlap/constant/fluid/dynamicMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| solids4foam: solid mechanics and fluid-solid interaction simulations        |
| Version:     v2.0                                                           |
| Web:         https://solids4foam.github.io                                  |
| Disclaimer:  This offering is not approved or endorsed by OpenCFD Limited,  |
|              producer and distributor of the OpenFOAM software via          |
|              www.openfoam.com](https://www.openfoam.com), and owner of the  |
|              OPENFOAM® and OpenCFD® trade marks.                            |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      dynamicMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dynamicFvMesh dynamicMotionSolverFvMesh;

"solver|motionSolver" velocityLaplacian; // finite volume solver
//"solver|motionSolver" laplace; // finite element solver
//"solver|motionSolver" RBFMeshMotionSolver; // radial basis function solver

diffusivity quadratic inverseDistance (interface);

// Settings for the RBF solver
// staticPatches    (top bottom left);
// movingPatches    (interface);
// fixedPatches     (inlet outlet);
// interpolation
// {
//     function     TPS;
// }
// coarsening
// {
//     enabled      no;
// }

// ************************************************************************* //
